PinguinoIDE/pinguino-compilers/linux64/p8/share/gputils/header/p16lf1567.inc
;----- IOCBF Bits -----------------------------------------------------
IOCBF0           EQU  H'0000'
IOCBF1           EQU  H'0001'
IOCBF2           EQU  H'0002'
IOCBF3           EQU  H'0003'
IOCBF4           EQU  H'0004'
IOCBF5           EQU  H'0005'
IOCBF6           EQU  H'0006'
IOCBF7           EQU  H'0007'



;----- T4CON Bits -----------------------------------------------------
TMR4ON           EQU  H'0002'

T4CKPS0          EQU  H'0000'
T4CKPS1          EQU  H'0001'
T4OUTPS0         EQU  H'0003'
T4OUTPS1         EQU  H'0004'
T4OUTPS2         EQU  H'0005'
T4OUTPS3         EQU  H'0006'


;----- PWM1DCL Bits -----------------------------------------------------
PWM1DCL0         EQU  H'0006'
PWM1DCL1         EQU  H'0007'


;----- PWM1DCH Bits -----------------------------------------------------
PWM1DCH0         EQU  H'0000'
PWM1DCH1         EQU  H'0001'
PWM1DCH2         EQU  H'0002'
PWM1DCH3         EQU  H'0003'
PWM1DCH4         EQU  H'0004'
PWM1DCH5         EQU  H'0005'
PWM1DCH6         EQU  H'0006'
PWM1DCH7         EQU  H'0007'


;----- PWM1CON Bits -----------------------------------------------------
PWM1POL          EQU  H'0004'
PWM1OUT          EQU  H'0005'
PWM1OE           EQU  H'0006'
PWM1EN           EQU  H'0007'


;----- PWM1CON0 Bits -----------------------------------------------------
PWM1POL          EQU  H'0004'
PWM1OUT          EQU  H'0005'
PWM1OE           EQU  H'0006'
PWM1EN           EQU  H'0007'


;----- PWM2DCL Bits -----------------------------------------------------
PWM2DCL0         EQU  H'0006'
PWM2DCL1         EQU  H'0007'


;----- PWM2DCH Bits -----------------------------------------------------
PWM2DCH0         EQU  H'0000'
PWM2DCH1         EQU  H'0001'
PWM2DCH2         EQU  H'0002'
PWM2DCH3         EQU  H'0003'
PWM2DCH4         EQU  H'0004'
PWM2DCH5         EQU  H'0005'
PWM2DCH6         EQU  H'0006'
PWM2DCH7         EQU  H'0007'


;----- PWM2CON Bits -----------------------------------------------------
PWM2POL          EQU  H'0004'
PWM2OUT          EQU  H'0005'
PWM2OE           EQU  H'0006'
PWM2EN           EQU  H'0007'


;----- PWM2CON0 Bits -----------------------------------------------------
PWM2POL          EQU  H'0004'
PWM2OUT          EQU  H'0005'
PWM2OE           EQU  H'0006'
PWM2EN           EQU  H'0007'


;----- PWMTMRS Bits -----------------------------------------------------
P1TSEL           EQU  H'0000'
P2TSEL           EQU  H'0002'


;----- PWM1AOE Bits -----------------------------------------------------
PWM1OE0          EQU  H'0000'
PWM1OE1          EQU  H'0001'
PWM1OE2          EQU  H'0002'
PWM1OE3          EQU  H'0003'


;----- PWM2AOE Bits -----------------------------------------------------
PWM2OE0          EQU  H'0000'
PWM2OE1          EQU  H'0001'
PWM2OE2          EQU  H'0002'
PWM2OE3          EQU  H'0003'


;----- ADCTX Bits -----------------------------------------------------
A1TX0            EQU  H'0000'
A1TX1            EQU  H'0001'
A1TX2            EQU  H'0002'
A2TX0            EQU  H'0004'
A2TX1            EQU  H'0005'
A2TX2            EQU  H'0006'


;----- AAD1TX0 Bits -----------------------------------------------------
TX10             EQU  H'0000'
TX11             EQU  H'0001'
TX12             EQU  H'0002'
TX13             EQU  H'0003'
TX14             EQU  H'0004'
TX15             EQU  H'0005'
TX16             EQU  H'0006'
TX17             EQU  H'0007'


;----- AD1TX0 Bits -----------------------------------------------------
TX10             EQU  H'0000'
TX11             EQU  H'0001'
TX12             EQU  H'0002'
TX13             EQU  H'0003'
TX14             EQU  H'0004'
TX15             EQU  H'0005'
TX16             EQU  H'0006'
TX17             EQU  H'0007'


;----- AAD1TX1 Bits -----------------------------------------------------
TX18             EQU  H'0000'
TX19             EQU  H'0001'
TX30             EQU  H'0002'
TX31             EQU  H'0003'
TX32             EQU  H'0004'
TX33             EQU  H'0005'
TX34             EQU  H'0006'
TX35             EQU  H'0007'


;----- AD1TX1 Bits -----------------------------------------------------
TX18             EQU  H'0000'
TX19             EQU  H'0001'
TX30             EQU  H'0002'
TX31             EQU  H'0003'
TX32             EQU  H'0004'
TX33             EQU  H'0005'
TX34             EQU  H'0006'
TX35             EQU  H'0007'


;----- AAD2TX0 Bits -----------------------------------------------------
TX20             EQU  H'0000'
TX21             EQU  H'0001'
TX22             EQU  H'0002'
TX23             EQU  H'0003'
TX24             EQU  H'0004'
TX25             EQU  H'0005'
TX26             EQU  H'0006'
TX27             EQU  H'0007'


;----- AD2TX0 Bits -----------------------------------------------------
TX20             EQU  H'0000'
TX21             EQU  H'0001'
TX22             EQU  H'0002'
TX23             EQU  H'0003'
TX24             EQU  H'0004'
TX25             EQU  H'0005'
TX26             EQU  H'0006'
TX27             EQU  H'0007'


;----- AAD2TX1 Bits -----------------------------------------------------
TX28             EQU  H'0000'
TX29             EQU  H'0001'
TX40             EQU  H'0002'
TX41             EQU  H'0003'
TX42             EQU  H'0004'
TX43             EQU  H'0005'
TX44             EQU  H'0006'
TX45             EQU  H'0007'


;----- AD2TX1 Bits -----------------------------------------------------
TX28             EQU  H'0000'
TX29             EQU  H'0001'
TX40             EQU  H'0002'
TX41             EQU  H'0003'
TX42             EQU  H'0004'
TX43             EQU  H'0005'
TX44             EQU  H'0006'
TX45             EQU  H'0007'


;----- AAD1CON0 Bits -----------------------------------------------------
ADON             EQU  H'0000'
GO_AAD1CON0      EQU  H'0001'

AD1ON            EQU  H'0000'
GO_NOT_DONE      EQU  H'0001'
CHS0             EQU  H'0002'
CHS1             EQU  H'0003'
CHS2             EQU  H'0004'
CHS3             EQU  H'0005'
CHS4             EQU  H'0006'
CHS5             EQU  H'0007'

GO_NOT_DONE1     EQU  H'0001'


;----- AADCON0 Bits -----------------------------------------------------
ADON             EQU  H'0000'
GO_AADCON0       EQU  H'0001'

AD1ON            EQU  H'0000'
GO_NOT_DONE      EQU  H'0001'
CHS0             EQU  H'0002'
CHS1             EQU  H'0003'
CHS2             EQU  H'0004'
CHS3             EQU  H'0005'
CHS4             EQU  H'0006'
CHS5             EQU  H'0007'

GO_NOT_DONE1     EQU  H'0001'


;----- AD1CON0 Bits -----------------------------------------------------
ADON             EQU  H'0000'
GO_AD1CON0       EQU  H'0001'

AD1ON            EQU  H'0000'
GO_NOT_DONE      EQU  H'0001'
CHS0             EQU  H'0002'
CHS1             EQU  H'0003'
CHS2             EQU  H'0004'
CHS3             EQU  H'0005'
CHS4             EQU  H'0006'
CHS5             EQU  H'0007'

GO_NOT_DONE1     EQU  H'0001'


