PinguinoIDE/pinguino-compilers/linux64/p8/share/gputils/header/p16lf1567.inc
;----- AD1CAPCON Bits -----------------------------------------------------
ADDCAP0          EQU  H'0000'
ADDCAP1          EQU  H'0001'
ADDCAP2          EQU  H'0002'
ADDCAP3          EQU  H'0003'



;----- AAD1CH0 Bits -----------------------------------------------------
CH10             EQU  H'0000'
CH11             EQU  H'0001'
CH12             EQU  H'0002'
CH13             EQU  H'0003'
CH14             EQU  H'0004'
CH15             EQU  H'0005'
CH16             EQU  H'0006'
CHS17            EQU  H'0007'


;----- AD1CH0 Bits -----------------------------------------------------
CH10             EQU  H'0000'
CH11             EQU  H'0001'
CH12             EQU  H'0002'
CH13             EQU  H'0003'
CH14             EQU  H'0004'
CH15             EQU  H'0005'
CH16             EQU  H'0006'
CHS17            EQU  H'0007'


;----- AAD1CH1 Bits -----------------------------------------------------
CH18             EQU  H'0000'
CH19             EQU  H'0001'
CH30             EQU  H'0002'
CH31             EQU  H'0003'
CH32             EQU  H'0004'
CH33             EQU  H'0005'
CH34             EQU  H'0006'
CH35             EQU  H'0007'


;----- AD1CH1 Bits -----------------------------------------------------
CH18             EQU  H'0000'
CH19             EQU  H'0001'
CH30             EQU  H'0002'
CH31             EQU  H'0003'
CH32             EQU  H'0004'
CH33             EQU  H'0005'
CH34             EQU  H'0006'
CH35             EQU  H'0007'


;----- AAD2CON0 Bits -----------------------------------------------------
ADON             EQU  H'0000'
GO_AAD2CON0      EQU  H'0001'

AD2ON            EQU  H'0000'
GO_NOT_DONE      EQU  H'0001'
CHS0             EQU  H'0002'
CHS1             EQU  H'0003'
CHS2             EQU  H'0004'
CHS3             EQU  H'0005'
CHS4             EQU  H'0006'
CHS5             EQU  H'0007'

GO_NOT_DONE2     EQU  H'0001'


;----- AD2CON0 Bits -----------------------------------------------------
ADON             EQU  H'0000'
GO_AD2CON0       EQU  H'0001'

AD2ON            EQU  H'0000'
GO_NOT_DONE      EQU  H'0001'
CHS0             EQU  H'0002'
CHS1             EQU  H'0003'
CHS2             EQU  H'0004'
CHS3             EQU  H'0005'
CHS4             EQU  H'0006'
CHS5             EQU  H'0007'

GO_NOT_DONE2     EQU  H'0001'


;----- AAD2CON2 Bits -----------------------------------------------------
TRIGSEL0         EQU  H'0004'
TRIGSEL1         EQU  H'0005'
TRIGSEL2         EQU  H'0006'


;----- AD2CON2 Bits -----------------------------------------------------
TRIGSEL0         EQU  H'0004'
TRIGSEL1         EQU  H'0005'
TRIGSEL2         EQU  H'0006'


;----- AAD2CON3 Bits -----------------------------------------------------
AD2DSEN          EQU  H'0000'
AD2IPEN          EQU  H'0001'
AD2IPPOL         EQU  H'0006'
AD2EPPOL         EQU  H'0007'

ADDSEN           EQU  H'0000'
ADIPEN           EQU  H'0001'
ADIPPOL          EQU  H'0006'
ADEPPOL          EQU  H'0007'


;----- AD2CON3 Bits -----------------------------------------------------
AD2DSEN          EQU  H'0000'
AD2IPEN          EQU  H'0001'
AD2IPPOL         EQU  H'0006'
AD2EPPOL         EQU  H'0007'

ADDSEN           EQU  H'0000'
ADIPEN           EQU  H'0001'
ADIPPOL          EQU  H'0006'
ADEPPOL          EQU  H'0007'


;----- AAD2PRE Bits -----------------------------------------------------
ADPRE0           EQU  H'0000'
ADPRE1           EQU  H'0001'
ADPRE2           EQU  H'0002'
ADPRE3           EQU  H'0003'
ADPRE4           EQU  H'0004'
ADPRE5           EQU  H'0005'
ADPRE6           EQU  H'0006'


;----- AD2PRE Bits -----------------------------------------------------
ADPRE0           EQU  H'0000'
ADPRE1           EQU  H'0001'
ADPRE2           EQU  H'0002'
ADPRE3           EQU  H'0003'
ADPRE4           EQU  H'0004'
ADPRE5           EQU  H'0005'
ADPRE6           EQU  H'0006'


;----- AD2PRECON Bits -----------------------------------------------------
ADPRE0           EQU  H'0000'
ADPRE1           EQU  H'0001'
ADPRE2           EQU  H'0002'
ADPRE3           EQU  H'0003'
ADPRE4           EQU  H'0004'
ADPRE5           EQU  H'0005'
ADPRE6           EQU  H'0006'


;----- AAD2ACQ Bits -----------------------------------------------------
ADACQ0           EQU  H'0000'
ADACQ1           EQU  H'0001'
ADACQ2           EQU  H'0002'
ADACQ3           EQU  H'0003'
ADACQ4           EQU  H'0004'
ADACQ5           EQU  H'0005'
ADACQ6           EQU  H'0006'


;----- AD2ACQ Bits -----------------------------------------------------
ADACQ0           EQU  H'0000'
ADACQ1           EQU  H'0001'
ADACQ2           EQU  H'0002'
ADACQ3           EQU  H'0003'
ADACQ4           EQU  H'0004'
ADACQ5           EQU  H'0005'
ADACQ6           EQU  H'0006'


;----- AD2ACQCON Bits -----------------------------------------------------
ADACQ0           EQU  H'0000'
ADACQ1           EQU  H'0001'
ADACQ2           EQU  H'0002'
ADACQ3           EQU  H'0003'
ADACQ4           EQU  H'0004'
ADACQ5           EQU  H'0005'
ADACQ6           EQU  H'0006'


;----- AAD2GRD Bits -----------------------------------------------------
TX2POL           EQU  H'0000'
GRD2POL          EQU  H'0005'
GRD2AOE          EQU  H'0006'
GRD2BOE          EQU  H'0007'

TXPOL            EQU  H'0000'
GRDPOL           EQU  H'0005'
GRDAOE           EQU  H'0006'
GRDBOE           EQU  H'0007'


;----- AD2GRD Bits -----------------------------------------------------
TX2POL           EQU  H'0000'
GRD2POL          EQU  H'0005'
GRD2AOE          EQU  H'0006'
GRD2BOE          EQU  H'0007'

TXPOL            EQU  H'0000'
GRDPOL           EQU  H'0005'
GRDAOE           EQU  H'0006'
GRDBOE           EQU  H'0007'


;----- AAD2CAP Bits -----------------------------------------------------
ADDCAP0          EQU  H'0000'
ADDCAP1          EQU  H'0001'
ADDCAP2          EQU  H'0002'
ADDCAP3          EQU  H'0003'



;----- AAD2CAPCON Bits -----------------------------------------------------
ADDCAP0          EQU  H'0000'
ADDCAP1          EQU  H'0001'
ADDCAP2          EQU  H'0002'
ADDCAP3          EQU  H'0003'



;----- AD2CAPCON Bits -----------------------------------------------------
ADDCAP0          EQU  H'0000'
ADDCAP1          EQU  H'0001'
ADDCAP2          EQU  H'0002'
ADDCAP3          EQU  H'0003'



;----- AAD2CH0 Bits -----------------------------------------------------
CH20             EQU  H'0000'
CH21             EQU  H'0001'
CH22             EQU  H'0002'
CH23             EQU  H'0003'
CH24             EQU  H'0004'
CH25             EQU  H'0005'
CH26             EQU  H'0006'
CH27             EQU  H'0007'


;----- AD2CH0 Bits -----------------------------------------------------
CH20             EQU  H'0000'
CH21             EQU  H'0001'
CH22             EQU  H'0002'
CH23             EQU  H'0003'
CH24             EQU  H'0004'
CH25             EQU  H'0005'
CH26             EQU  H'0006'
CH27             EQU  H'0007'


;----- AAD2CH1 Bits -----------------------------------------------------
CH28             EQU  H'0000'
CH29             EQU  H'0001'
CH40             EQU  H'0002'
CH41             EQU  H'0003'
CH42             EQU  H'0004'
CH43             EQU  H'0005'
CH44             EQU  H'0006'
CH45             EQU  H'0007'


;----- AD2CH1 Bits -----------------------------------------------------
CH28             EQU  H'0000'
CH29             EQU  H'0001'
CH40             EQU  H'0002'
CH41             EQU  H'0003'
CH42             EQU  H'0004'
CH43             EQU  H'0005'
CH44             EQU  H'0006'
CH45             EQU  H'0007'


;----- ICDIO Bits -----------------------------------------------------
TRIS_ICDCLK      EQU  H'0002'
TRIS_ICDDAT      EQU  H'0003'
LAT_ICDCLK       EQU  H'0004'
LAT_ICDDAT       EQU  H'0005'
PORT_ICDCLK      EQU  H'0006'
PORT_ICDDAT      EQU  H'0007'


;----- ICDCON0 Bits -----------------------------------------------------
RSTVEC           EQU  H'0000'
DBGINEX          EQU  H'0003'
SSTEP            EQU  H'0005'
FREEZ            EQU  H'0006'
INBUG            EQU  H'0007'


;----- ICDSTAT Bits -----------------------------------------------------
USRHLTF          EQU  H'0001'
TRP0HLTF         EQU  H'0006'
TRP1HLTF         EQU  H'0007'


;----- ICDINSTL Bits -----------------------------------------------------
DBGIN0           EQU  H'0000'
DBGIN1           EQU  H'0001'
DBGIN2           EQU  H'0002'
DBGIN3           EQU  H'0003'
DBGIN4           EQU  H'0004'
DBGIN5           EQU  H'0005'
DBGIN6           EQU  H'0006'
DBGIN7           EQU  H'0007'


